namespace mensajesSpace;

public class Mensajes
{
    public void Bienvenida()
    {
        Console.WriteLine(@"
██████╗░██╗███████╗███╗░░██╗██╗░░░██╗███████╗███╗░░██╗██╗██████╗░░█████╗░  ░█████╗░  ██╗░░░░░░█████╗░
██╔══██╗██║██╔════╝████╗░██║██║░░░██║██╔════╝████╗░██║██║██╔══██╗██╔══██╗  ██╔══██╗  ██║░░░░░██╔══██╗
██████╦╝██║█████╗░░██╔██╗██║╚██╗░██╔╝█████╗░░██╔██╗██║██║██║░░██║██║░░██║  ███████║  ██║░░░░░███████║
██╔══██╗██║██╔══╝░░██║╚████║░╚████╔╝░██╔══╝░░██║╚████║██║██║░░██║██║░░██║  ██╔══██║  ██║░░░░░██╔══██║
██████╦╝██║███████╗██║░╚███║░░╚██╔╝░░███████╗██║░╚███║██║██████╔╝╚█████╔╝  ██║░░██║  ███████╗██║░░██║
╚═════╝░╚═╝╚══════╝╚═╝░░╚══╝░░░╚═╝░░░╚══════╝╚═╝░░╚══╝╚═╝╚═════╝░░╚════╝░  ╚═╝░░╚═╝  ╚══════╝╚═╝░░╚═╝

░██████╗░██████╗░██╗███████╗████████╗░█████╗░
██╔════╝░██╔══██╗██║██╔════╝╚══██╔══╝██╔══██╗
██║░░██╗░██████╔╝██║█████╗░░░░░██║░░░███████║
██║░░╚██╗██╔══██╗██║██╔══╝░░░░░██║░░░██╔══██║
╚██████╔╝██║░░██║██║███████╗░░░██║░░░██║░░██║
░╚═════╝░╚═╝░░╚═╝╚═╝╚══════╝░░░╚═╝░░░╚═╝░░╚═╝

██╗███╗░░██╗██╗░░░██╗░█████╗░░█████╗░░█████╗░██████╗░░█████╗░██████╗░
██║████╗░██║██║░░░██║██╔══██╗██╔══██╗██╔══██╗██╔══██╗██╔══██╗██╔══██╗
██║██╔██╗██║╚██╗░██╔╝██║░░██║██║░░╚═╝███████║██║░░██║██║░░██║██████╔╝
██║██║╚████║░╚████╔╝░██║░░██║██║░░██╗██╔══██║██║░░██║██║░░██║██╔══██╗
██║██║░╚███║░░╚██╔╝░░╚█████╔╝╚█████╔╝██║░░██║██████╔╝╚█████╔╝██║░░██║
╚═╝╚═╝░░╚══╝░░░╚═╝░░░░╚════╝░░╚════╝░╚═╝░░╚═╝╚═════╝░░╚════╝░╚═╝░░╚═╝");
    }

    public void mensajeIntroduccion()
    {
        Console.WriteLine(@"
ℍ𝕠𝕪, 𝕡𝕣𝕖𝕤𝕖𝕟𝕔𝕚𝕒𝕞𝕠𝕤 𝕦𝕟 𝕖𝕧𝕖𝕟𝕥𝕠 𝕤𝕚𝕟𝕘𝕦𝕝𝕒𝕣 𝕪 𝕖́𝕡𝕚𝕔𝕠: 𝕦𝕟 𝕖𝕟𝕗𝕣𝕖𝕟𝕥𝕒𝕞𝕚𝕖𝕟𝕥𝕠 𝕦𝕟𝕠 
𝕔𝕠𝕟𝕥𝕣𝕒 𝕦𝕟𝕠 𝕕𝕠𝕟𝕕𝕖 𝕤𝕠𝕝𝕠 𝕝𝕠𝕤 𝕞𝕒́𝕤 𝕗𝕦𝕖𝕣𝕥𝕖𝕤, 𝕙𝕒́𝕓𝕚𝕝𝕖𝕤 𝕪 𝕒𝕤𝕥𝕦𝕥𝕠𝕤 𝕡𝕣𝕖𝕧𝕒𝕝𝕖𝕔𝕖𝕣𝕒́𝕟.
𝔼𝕟 𝕖𝕤𝕥𝕖 𝕔𝕠𝕝𝕚𝕤𝕖𝕠 𝕕𝕖 𝕓𝕒𝕥𝕒𝕝𝕝𝕒, 𝕔𝕒𝕕𝕒 𝕚𝕟𝕧𝕠𝕔𝕒𝕕𝕠𝕣 𝕝𝕦𝕔𝕙𝕒𝕣𝕒́ 𝕗𝕖𝕣𝕠𝕫𝕞𝕖𝕟𝕥𝕖 𝕔𝕠𝕟𝕥𝕣𝕒 
𝕤𝕦 𝕠𝕡𝕠𝕟𝕖𝕟𝕥𝕖, 𝕕𝕖𝕞𝕠𝕤𝕥𝕣𝕒𝕟𝕕𝕠 𝕤𝕦 𝕞𝕒𝕖𝕤𝕥𝕣𝕚́𝕒 𝕖𝕟 𝕔𝕠𝕞𝕓𝕒𝕥𝕖, 𝕖𝕤𝕥𝕣𝕒𝕥𝕖𝕘𝕚𝕒 𝕪 𝕕𝕠𝕞𝕚𝕟𝕚𝕠 
𝕕𝕖𝕝 𝕔𝕒𝕞𝕡𝕖𝕠́𝕟 𝕖𝕝𝕖𝕘𝕚𝕕𝕠.

𝕃𝕒𝕤 𝕣𝕖𝕘𝕝𝕒𝕤 𝕤𝕠𝕟 𝕤𝕚𝕞𝕡𝕝𝕖𝕤: 𝕖𝕝 𝕧𝕖𝕟𝕔𝕖𝕕𝕠𝕣 𝕕𝕖 𝕔𝕒𝕕𝕒 𝕔𝕠𝕞𝕓𝕒𝕥𝕖 𝕒𝕧𝕒𝕟𝕫𝕒𝕣𝕒́ 𝕒 𝕝𝕒 
𝕤𝕚𝕘𝕦𝕚𝕖𝕟𝕥𝕖 𝕣𝕠𝕟𝕕𝕒, 𝕖𝕟𝕗𝕣𝕖𝕟𝕥𝕒́𝕟𝕕𝕠𝕤𝕖 𝕒 𝕦𝕟 𝕟𝕦𝕖𝕧𝕠 𝕣𝕚𝕧𝕒𝕝. 𝔸𝕤𝕚́ 𝕔𝕠𝕟𝕥𝕚𝕟𝕦𝕒𝕣𝕒́ 𝕝𝕒 
𝕔𝕠𝕟𝕥𝕚𝕖𝕟𝕕𝕒, 𝕙𝕒𝕤𝕥𝕒 𝕢𝕦𝕖 𝕤𝕠𝕝𝕠 𝕢𝕦𝕖𝕕𝕖 𝕦𝕟 𝕚𝕟𝕧𝕠𝕔𝕒𝕕𝕠𝕣 𝕖𝕟 𝕡𝕚𝕖. 𝔼𝕤𝕥𝕖 𝕦́𝕝𝕥𝕚𝕞𝕠 
𝕘𝕦𝕖𝕣𝕣𝕖𝕣𝕠, 𝕙𝕒𝕓𝕚𝕖𝕟𝕕𝕠 𝕤𝕦𝕡𝕖𝕣𝕒𝕕𝕠 𝕒 𝕥𝕠𝕕𝕠𝕤 𝕝𝕠𝕤 𝕕𝕖𝕞𝕒́𝕤, 𝕤𝕖𝕣𝕒́ 𝕡𝕣𝕠𝕔𝕝𝕒𝕞𝕒𝕕𝕠 𝕖𝕝 𝕘𝕣𝕒𝕟 
𝕔𝕒𝕞𝕡𝕖𝕠́𝕟 𝕕𝕖 𝕖𝕤𝕥𝕒 𝕛𝕠𝕣𝕟𝕒𝕕𝕒 𝕕𝕖 𝕕𝕦𝕖𝕝𝕠𝕤.

ℙ𝕣𝕖𝕡𝕒́𝕣𝕖𝕟𝕤𝕖, 𝕒𝕗𝕚𝕝𝕖𝕟 𝕤𝕦𝕤 𝕙𝕒𝕓𝕚𝕝𝕚𝕕𝕒𝕕𝕖𝕤 𝕪 𝕕𝕖𝕤𝕒𝕥𝕖𝕟 𝕖𝕝 𝕡𝕠𝕕𝕖𝕣 𝕕𝕖 𝕤𝕦𝕤 𝕔𝕒𝕞𝕡𝕖𝕠𝕟𝕖𝕤.
𝕃𝕒 𝕓𝕒𝕥𝕒𝕝𝕝𝕒 𝕡𝕠𝕣 𝕝𝕒 𝕤𝕦𝕡𝕣𝕖𝕞𝕒𝕔𝕚́𝕒 𝕚𝕟𝕕𝕚𝕧𝕚𝕕𝕦𝕒𝕝 𝕖𝕟 𝕝𝕒 𝔾𝕣𝕚𝕖𝕥𝕒 𝕕𝕖𝕝 𝕀𝕟𝕧𝕠𝕔𝕒𝕕𝕠𝕣 
𝕔𝕠𝕞𝕚𝕖𝕟𝕫𝕒 𝕒𝕙𝕠𝕣𝕒. ¡ℚ𝕦𝕖 𝕝𝕠𝕤 𝕞𝕖𝕛𝕠𝕣𝕖𝕤 𝕚𝕟𝕧𝕠𝕔𝕒𝕕𝕠𝕣𝕖𝕤 𝕤𝕖 𝕖𝕟𝕗𝕣𝕖𝕟𝕥𝕖𝕟 𝕪 𝕢𝕦𝕖 𝕝𝕒 
𝕧𝕚𝕔𝕥𝕠𝕣𝕚𝕒 𝕔𝕠𝕣𝕠𝕟𝕖 𝕒𝕝 𝕞𝕒́𝕤 𝕕𝕚𝕘𝕟𝕠!

¡ℚ𝕦𝕖 𝕔𝕠𝕞𝕚𝕖𝕟𝕔𝕖 𝕖𝕝 𝕕𝕦𝕖𝕝𝕠!
");
    }

    public void preguntaSobrePersonaje()
    {
        Console.WriteLine(@"𝖨𝗇𝗏𝗈𝖼𝖺𝖽𝗈𝗋, ¿𝗊𝗎𝖾́ 𝖼𝖺𝗆𝗉𝖾𝗈́𝗇 𝖾𝗅𝖾𝗀𝗂𝗋𝖺́𝗌 𝗉𝖺𝗋𝖺 𝖾𝗇𝖿𝗋𝖾𝗇𝗍𝖺𝗋𝗍𝖾 𝖾𝗇 𝗅𝖺 𝖦𝗋𝗂𝖾𝗍𝖺 𝖽𝖾𝗅 𝖨𝗇𝗏𝗈𝖼𝖺𝖽𝗈𝗋? 𝖨𝗇𝗍𝗋𝗈𝖽𝗎𝖼𝖾 𝖾𝗅 𝗇𝗎́𝗆𝖾𝗋𝗈 𝖼𝗈𝗋𝗋𝖾𝗌𝗉𝗈𝗇𝖽𝗂𝖾𝗇𝗍𝖾 𝖺 𝗍𝗎 𝖾𝗅𝖾𝖼𝖼𝗂𝗈́𝗇:");
    }

}